Show / Hide Table of Contents
Class ConcreteSetup
Concrete setup base class
Inheritance
System.Object
OpenObject
OpenElementId
ConcreteSetup
ConcreteSetupEc2
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete
Assembly: IdeaRS.OpenModel.dll
Syntax
public abstract class ConcreteSetup : OpenElementId
Constructors
Improve this Doc   View Source
ConcreteSetup()
Constructor
Declaration
protected ConcreteSetup()
Properties
Improve this Doc   View Source
SetupValues
Setup values
Declaration
public List<SetupValue> SetupValues { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<SetupValue>
 Improve this Doc
 View Source